import { IНоменклатура, IХарактеристика } from "@/interfaces/IDocument"

export function GetCountFromBarcode(ПолныйШК:string,Номенклатура:IНоменклатура,Характеристика:IХарактеристика, Грузоместа:number, Количество:number) {
    
    let count = ПолныйШК.slice(ПолныйШК.length - 5)
    let КоличествоВЕдиницахИзмерения:number = Количество
  
    let mutch = false
  
    if (Номенклатура.ЕдиницаИзмерения.Наименование === "шт") {
      
      if (count.slice(0, 2) === '37') {
        КоличествоВЕдиницахИзмерения = Number(count.slice(count.length - 3))
        mutch = true
      }
  
      if (count.slice(0, 2) === '91') {
        count = ПолныйШК.slice(ПолныйШК.length - 10)
        if (count.slice(0, 2) === '37') {
          КоличествоВЕдиницахИзмерения = Number(count.slice(2, 5))
          mutch = true
        }
      }
  
  
    }
    //return (1 * КоличествоВЕдиницахИзмерения)
    
    if (Характеристика.ДополнительныеРеквизиты[1] !== undefined && Номенклатура.ЕдиницаИзмерения.Наименование==="шт") {
      if (Характеристика.ДополнительныеРеквизиты[1].Свойство.Наименование==="Количество(хар)" && !mutch) {
        КоличествоВЕдиницахИзмерения = Характеристика.ДополнительныеРеквизиты[1].Значение * Грузоместа
      }
    }
  
    return (1 * КоличествоВЕдиницахИзмерения)
  }